app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello Ruby on Rails"], ["body", "this is body"], ["created_at", "2021-07-16 16:48:04.670843"], ["updated_at", "2021-07-16 16:48:04.670843"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "This is new article"], ["updated_at", "2021-07-16 11:24:03.445973"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)